server/libs/providers/FedEx/wsdl/SPODFAX_Request.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v6="http://fedex.com/ws/track/v6">
<soapenv:Header/>
<soapenv:Body>
<v6:SignatureProofOfDeliveryFaxRequest>
<v6:WebAuthenticationDetail>
<v6:UserCredential>
<v6:Key></v6:Key>
<v6:Password></v6:Password>
</v6:UserCredential>
</v6:WebAuthenticationDetail>
<v6:ClientDetail>
<v6:AccountNumber></v6:AccountNumber>
<v6:MeterNumber></v6:MeterNumber>  
<v6:Localization>
<v6:LanguageCode>EN</v6:LanguageCode>
<v6:LocaleCode>EM</v6:LocaleCode></v6:Localization>
</v6:ClientDetail>
<v6:TransactionDetail>
<v6:CustomerTransactionId>SPOD FAX Request</v6:CustomerTransactionId>
<v6:Localization>
<v6:LanguageCode>EN</v6:LanguageCode>
<v6:LocaleCode>EM</v6:LocaleCode>
</v6:Localization>
</v6:TransactionDetail>
<v6:Version>
<v6:ServiceId>trck</v6:ServiceId>
<v6:Major>6</v6:Major>
<v6:Intermediate>0</v6:Intermediate>
<v6:Minor>0</v6:Minor>
</v6:Version>
<v6:QualifiedTrackingNumber>
<v6:TrackingNumber>400030715008165</v6:TrackingNumber>
<v6:ShipDate>2011-01-03</v6:ShipDate>
<v6:AccountNumber>195274401</v6:AccountNumber>
<v6:Carrier>FDXG</v6:Carrier>
<v6:Destination>
<v6:StreetLines>Talawade</v6:StreetLines>
<v6:City>Texas</v6:City>
<v6:StateOrProvinceCode>TX</v6:StateOrProvinceCode>
<v6:PostalCode>73301</v6:PostalCode> 
<v6:CountryCode>US</v6:CountryCode>
  </v6:Destination>
</v6:QualifiedTrackingNumber>
<v6:AdditionalComments>comments</v6:AdditionalComments>
<v6:FaxSender>
<v6:Contact>
<v6:PersonName>Shriyash</v6:PersonName>
<v6:Title>Syntel</v6:Title>
<v6:CompanyName>Syntel</v6:CompanyName>
<v6:PhoneNumber>9970107757</v6:PhoneNumber>
<v6:PhoneExtension>3469</v6:PhoneExtension>
<v6:FaxNumber>1234567897</v6:FaxNumber>
<v6:EMailAddress>shriyash_khisti@syntelinc.com</v6:EMailAddress>
</v6:Contact>
<v6:Address>
<v6:StreetLines>Talawade</v6:StreetLines>
<v6:City>Texas</v6:City>
<v6:StateOrProvinceCode>TX</v6:StateOrProvinceCode>
<v6:PostalCode>73301</v6:PostalCode> 
<v6:CountryCode>US</v6:CountryCode>
</v6:Address>
</v6:FaxSender>
<v6:FaxRecipient>
<v6:Contact>
<v6:PersonName>Abhay</v6:PersonName>
<v6:Title>Syntel</v6:Title>
<v6:CompanyName>Syntel</v6:CompanyName>
<v6:PhoneNumber>9978665532</v6:PhoneNumber>
<v6:PhoneExtension>3469</v6:PhoneExtension>
<v6:FaxNumber>1234567896</v6:FaxNumber>
<v6:EMailAddress>Abhay_Palaskar@Syntelinc.com</v6:EMailAddress>
</v6:Contact>
<v6:Address>
<v6:StreetLines>string</v6:StreetLines>
<v6:City>Memphis</v6:City>
<v6:StateOrProvinceCode>TN</v6:StateOrProvinceCode>
<v6:PostalCode>38017</v6:PostalCode>
<v6:CountryCode>US</v6:CountryCode>
</v6:Address>
</v6:FaxRecipient>
</v6:SignatureProofOfDeliveryFaxRequest>
</soapenv:Body>
</soapenv:Envelope>